{
  "_name_or_path": "microsoft/beit-large-patch16-224-pt22k-ft22k",
  "architectures": [
    "BeitForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auxiliary_channels": 256,
  "auxiliary_concat_input": false,
  "auxiliary_loss_weight": 0.4,
  "auxiliary_num_convs": 1,
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "id2label": {
    "0": "adenocarcinoma_left.lower.lobe_T2_N0_M0_Ib",
    "1": "large.cell.carcinoma_left.hilum_T2_N2_M0_IIIa",
    "2": "normal",
    "3": "squamous.cell.carcinoma_left.hilum_T1_N2_M0_IIIa"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "adenocarcinoma_left.lower.lobe_T2_N0_M0_Ib": "0",
    "large.cell.carcinoma_left.hilum_T2_N2_M0_IIIa": "1",
    "normal": "2",
    "squamous.cell.carcinoma_left.hilum_T1_N2_M0_IIIa": "3"
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 0.1,
  "model_type": "beit",
  "num_attention_heads": 16,
  "num_channels": 3,
  "num_hidden_layers": 24,
  "out_indices": [
    3,
    5,
    7,
    11
  ],
  "patch_size": 16,
  "pool_scales": [
    1,
    2,
    3,
    6
  ],
  "problem_type": "single_label_classification",
  "semantic_loss_ignore_index": 255,
  "torch_dtype": "float32",
  "transformers_version": "4.26.1",
  "use_absolute_position_embeddings": false,
  "use_auxiliary_head": true,
  "use_mask_token": false,
  "use_mean_pooling": true,
  "use_relative_position_bias": true,
  "use_shared_relative_position_bias": false,
  "vocab_size": 8192
}
